In [30]:
import pandas as pd
import numpy as np

In [8]:
df = pd.Series(np.random.randint(0,7,size=10)) # generates a random series of data using numpy random
df

0    1
1    4
2    4
3    2
4    2
5    2
6    4
7    1
8    3
9    3
dtype: int32

In [9]:
s=pd.Series(np.random.randint(0,10,size=2))
s

0    6
1    4
dtype: int32

In [10]:
s.value_counts() #counts the values

6    1
4    1
Name: count, dtype: int64

In [11]:
tb= pd.DataFrame(np.random.randn(10,4)) 
tb

          0         1         2         3
0 -0.139813 -0.628880  1.046648 -0.011886
1  0.059959  0.839468  1.043865  0.315533
2  1.110920 -0.803774 -0.352619  0.257481
3  0.872487  1.352666  1.901338 -1.061377
4 -0.947880 -0.565355 -0.630312  0.039165
5 -0.496844  1.476481 -1.391627  0.591383
6 -0.689857  0.904579 -0.684555  0.389644
7 -0.644654 -0.055529 -1.584641 -1.026694
8 -0.398480  0.754233  0.824514  0.533885
9 -0.904019 -0.351781 -0.002864  1.443076

In [12]:
np.random.rand(10,4) #generates a random 10X4 matrix or 2D array

array([[0.86992366, 0.78095803, 0.55580117, 0.82221348],
       [0.50444135, 0.78678773, 0.69406895, 0.27980234],
       [0.88362313, 0.21333525, 0.40176273, 0.31944057],
       [0.02067426, 0.95789995, 0.39345776, 0.05652578],
       [0.70515186, 0.2025578 , 0.80227597, 0.52770487],
       [0.91512878, 0.53202727, 0.4436314 , 0.47993716],
       [0.89567798, 0.40621996, 0.10027905, 0.21831472],
       [0.09343642, 0.91718159, 0.75955312, 0.64114571],
       [0.92681558, 0.7524422 , 0.96116966, 0.41794157],
       [0.79097733, 0.4925134 , 0.99033043, 0.71945988]])

In [13]:
pieces = [tb[:3],tb[3:6],tb[7:]] # slices the d
pieces

[          0         1         2         3
 0 -0.139813 -0.628880  1.046648 -0.011886
 1  0.059959  0.839468  1.043865  0.315533
 2  1.110920 -0.803774 -0.352619  0.257481,
           0         1         2         3
 3  0.872487  1.352666  1.901338 -1.061377
 4 -0.947880 -0.565355 -0.630312  0.039165
 5 -0.496844  1.476481 -1.391627  0.591383,
           0         1         2         3
 7 -0.644654 -0.055529 -1.584641 -1.026694
 8 -0.398480  0.754233  0.824514  0.533885
 9 -0.904019 -0.351781 -0.002864  1.443076]

In [14]:
pd.concat(pieces)

          0         1         2         3
0 -0.139813 -0.628880  1.046648 -0.011886
1  0.059959  0.839468  1.043865  0.315533
2  1.110920 -0.803774 -0.352619  0.257481
3  0.872487  1.352666  1.901338 -1.061377
4 -0.947880 -0.565355 -0.630312  0.039165
5 -0.496844  1.476481 -1.391627  0.591383
7 -0.644654 -0.055529 -1.584641 -1.026694
8 -0.398480  0.754233  0.824514  0.533885
9 -0.904019 -0.351781 -0.002864  1.443076

In [15]:
left = pd.DataFrame({"key":["qwe","qwe"], "lval":[1,2]})
right = pd.DataFrame({"key":["qwe","qwe"], "rval":[4,5]})

In [16]:
left

   key  lval
0  qwe     1
1  qwe     2

In [17]:
pd.merge(left,right, on="key")

   key  lval  rval
0  qwe     1     4
1  qwe     1     5
2  qwe     2     4
3  qwe     2     5

In [18]:
left = pd.DataFrame({"key":["qwe","wer"], "lval":[1,2]})
right = pd.DataFrame({"key":["qwe","wer"], "rval":[4,5]})
pd.merge(left,right, on="key")

   key  lval  rval
0  qwe     1     4
1  wer     2     5

In [19]:
df=pd.DataFrame({
    "A":np.random.randint(0,19, size=10),
    "B":np.random.randint(0,19, size=10),
    "C":np.random.randint(0,19, size=10),
    "D":np.random.randint(0,19, size=10),
})
df

    A   B   C   D
0  18  15  13  16
1  16   3   7  13
2  17  13  12   0
3  11   0  18   8
4   6   9   4  18
5  18   2  14   0
6  18  16   3   9
7   3   3   4   0
8  18  10  13  11
9   6  11   7   0

In [20]:
df.groupby("A").sum() #group by based on A in ascending order

     B   C   D
A
3    3   4   0
6   20  11  18
11   0  18   8
16   3   7  13
17  13  12   0
18  43  43  36

In [21]:
df.head() #gives first 5 values

    A   B   C   D
0  18  15  13  16
1  16   3   7  13
2  17  13  12   0
3  11   0  18   8
4   6   9   4  18

In [22]:
tuples = list(zip(*[
    ['bar','nand','nand','nand','bar','foo','foo','lov'],
    ['one','two','one','two','one','two','one','two'],
    
]))
index = pd.MultiIndex.from_tuples(tuples,names=["first","second"])
df=pd.DataFrame(np.random.randn(8,2),index=index,columns=["A","B"])
df

                     A         B
first second
bar   one    -0.397656 -0.010825
nand  two    -1.699499  1.122973
      one     1.559813  1.310648
      two     0.099366 -2.656129
bar   one     0.004622 -1.797467
foo   two     0.025015  0.275046
      one     0.290174  0.952651
lov   two     1.072215 -1.289243

In [26]:
res = df.stack()
res

first  second
bar    one     A   -0.397656
               B   -0.010825
nand   two     A   -1.699499
               B    1.122973
       one     A    1.559813
               B    1.310648
       two     A    0.099366
               B   -2.656129
bar    one     A    0.004622
               B   -1.797467
foo    two     A    0.025015
               B    0.275046
       one     A    0.290174
               B    0.952651
lov    two     A    1.072215
               B   -1.289243
dtype: float64

In [33]:
df1 = pd.DataFrame({
    "A":["one","one","two","three"] * 3,
    "B":["A","B","C"]*4,
    "C":["foo","foo","foo","bar","bar","bar"]*2,
    "D": np.random.randn(12),
    "E": np.random.randn(12)
})
df1

        A  B    C         D         E
0     one  A  foo  1.537625  1.372395
1     one  B  foo  1.239453 -0.025301
2     two  C  foo -1.169337 -1.531571
3   three  A  bar  0.504561  1.099232
4     one  B  bar  1.089746  2.110575
5     one  C  bar  0.088585  0.335338
6     two  A  foo -0.378209  1.214930
7   three  B  foo  0.669413  2.149405
8     one  C  foo  1.714877  1.256639
9     one  A  bar  0.360921 -0.258405
10    two  B  bar  0.445688  0.202223
11  three  C  bar -0.712428  1.014677

In [34]:
pd.pivot_table(df1,values="D",index=["A","B"],columns=["C"])

C             bar       foo
A     B
one   A  0.360921  1.537625
      B  1.089746  1.239453
      C  0.088585  1.714877
three A  0.504561       NaN
      B       NaN  0.669413
      C -0.712428       NaN
two   A       NaN -0.378209
      B  0.445688       NaN
      C       NaN -1.169337

In [2]:
a=23
b=str(a)  # type casting from int to string..
b

'23'